InformationRegisters/СканированиеКассовыхЧековПодотчетныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СканированиеКассовыхЧековПодотчетныхЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КассовыйЧек</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассовыйЧекПодотчетногоЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательШиныМобильныхПриложений</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СканированиеКассовыхЧековПодотчетныхЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Включает чек в регистр: устанавливает отметку о том, что чек был отсканирован пользователем
//
// Параметры:
//  КассовыйЧек - ДокументСсылка.КассовыйЧекПодотчетногоЛица
//  Пользователь - ОпределяемыйТип.ПользовательШиныМобильныхПриложений - пользователь, отсканировавший чек
//               - Неопределено - текущий пользователь отсканировал чек
//
Процедура Включить(КассовыйЧек, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Пользователь) Тогда
		Возврат;
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.КассовыйЧек  = КассовыйЧек;
	Запись.Пользователь = Пользователь;
	Запись.Записать();
	
КонецПроцедуры

// Исключает чек из регистра: удаляет отметку о том, что чек был отсканирован пользователем
//
// Параметры:
//  КассовыйЧек - ДокументСсылка.КассовыйЧекПодотчетногоЛица
//  Пользователь - ОпределяемыйТип.ПользовательШиныМобильныхПриложений
//
Процедура Исключить(КассовыйЧек, Пользователь) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.КассовыйЧек  = КассовыйЧек;
	Запись.Пользователь = Пользователь;
	Запись.Удалить();
	
КонецПроцедуры

// Проверяет, что чек отсканирован указанным пользователем.
//
// Параметры:
//  КассовыйЧек - ДокументСсылка.КассовыйЧекПодотчетногоЛица
//  Пользователь - ОпределяемыйТип.ПользовательШиныМобильныхПриложений
// 
// Возвращаемое значение:
//  Булево - Истина, если в регистре есть запись, что чек отсканирован указанным пользователем
//
Функция НайтиЧекПользователя(КассовыйЧек, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КассовыйЧек",  КассовыйЧек);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сканирование.КассовыйЧек КАК КассовыйЧек
	|ИЗ
	|	РегистрСведений.СканированиеКассовыхЧековПодотчетныхЛиц КАК Сканирование
	|ГДЕ
	|	Сканирование.КассовыйЧек = &КассовыйЧек
	|	И Сканирование.Пользователь = &Пользователь";
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Позволяет при записи чека установить отметку, что он был отсканирован текущим пользователем.
// Непосредственно отметка записывается в транзакции записи документа - для этого в обработчике ПриЗаписи
// должен быть вызван метод ВключитьОбъект
//
// Параметры:
//  КассовыйЧекОбъект - ДокументОбъект.КассовыйЧекПодотчетногоЛица - записываемый чек
//
Процедура УстановитьТекущийПользовательОтсканировалЧек(КассовыйЧекОбъект) Экспорт
	
	КассовыйЧекОбъект.ДополнительныеСвойства.Вставить("ПользовательОтсканировалЧек", Пользователи.ТекущийПользователь());
	
КонецПроцедуры

// Позволяет при записи чека установить отметку, что он был отсканирован пользователем шины мобильных приложений.
// Непосредственно отметка записывается в транзакции записи документа - для этого в обработчике ПриЗаписи
// должен быть вызван метод ВключитьОбъект
//
// Параметры:
//  КассовыйЧекОбъект - ДокументОбъект.КассовыйЧекПодотчетногоЛица - записываемый чек
//  ПользовательШины - ОпределяемыйТип.ПользовательШиныМобильныхПриложений
//
Процедура УстановитьПользовательШиныОтсканировалЧек(КассовыйЧекОбъект, ПользовательШины) Экспорт
	
	КассовыйЧекОбъект.ДополнительныеСвойства.Вставить(
		"ПользовательШиныМобильныхПриложенийОтсканировалЧек",
		ПользовательШины);
	
КонецПроцедуры

// Включает записываемый чек (объект) в регистр.
// Объект должен быть подготовлен с помощью УстановитьТекущийПользовательОтсканировалЧек
// или УстановитьПользовательШиныОтсканировалЧек
//
// Параметры:
//  КассовыйЧекОбъект - ДокументОбъект.КассовыйЧекПодотчетногоЛица - записываемый чек
//
Процедура ВключитьОбъект(КассовыйЧекОбъект) Экспорт
	
	Если КассовыйЧекОбъект.ДополнительныеСвойства.Свойство("ПользовательОтсканировалЧек") Тогда
		Включить(
			КассовыйЧекОбъект.Ссылка,
			КассовыйЧекОбъект.ДополнительныеСвойства.ПользовательОтсканировалЧек);
	ИначеЕсли КассовыйЧекОбъект.ДополнительныеСвойства.Свойство("ПользовательШиныМобильныхПриложенийОтсканировалЧек") Тогда
		Включить(
			КассовыйЧекОбъект.Ссылка,
			КассовыйЧекОбъект.ДополнительныеСвойства.ПользовательШиныМобильныхПриложенийОтсканировалЧек);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
